In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.set_option('display.max_columns', None)

- Tenemos que crear DataFrames de las columnas numéricas y categóricas por separado.
- Nos damos cuenta que algunas columnas que deberían ser numéricas están en categóricas y viceversa, como por ejemplo la coluna 'age' que está en categórica y pertenece a numérica
- Procedemos al cambio de las clumnas con sus respectivas tipologías

In [3]:
df_numericos = pd.read_csv('numericos.csv', index_col=0)

In [4]:
# Muestra los valores de 'age'
df_numericos['age'].value_counts()

age
31    89
35    88
34    86
29    82
36    80
32    68
30    66
38    64
33    63
40    60
37    55
28    54
27    54
45    50
42    50
41    48
26    47
39    46
43    42
46    38
44    34
50    34
24    31
47    31
25    28
49    26
55    26
51    22
48    22
54    20
53    20
52    19
56    18
58    17
22    17
21    17
23    15
59    11
20    11
19     9
18     9
57     6
60     5
Name: count, dtype: int64

In [5]:
df_categoricos=pd.read_csv("categoricos.csv", index_col=0)

In [6]:
#  Muestra las primeras 5 filas
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,0,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,Yes
1,No,NaN,NaN,Life Sciences,0,ManAGeR,NaN,NaN,NaN,NaN,NaN,1
2,No,travel_rarely,Research & Development,Technical Degree,0,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,1
3,No,travel_rarely,NaN,Medical,1,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,False
4,No,NaN,NaN,Technical Degree,1,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,0

- Vamos a empezar a sacar información de cada columna

In [7]:
# Muestra los valores
df_categoricos["roledepartament"].value_counts()

roledepartament
rESEArcH SCiEntIst  -  Research & Development            2
MaNAgeR  -  Sales                                        2
hEalthCaRe reprEseNTaTiVe  -  Research & Development     2
SaleS EXeCuTivE  -  Sales                                2
labORAtoRy tEcHNICIAN  -  Research & Development         2
                                                        ..
labORaTORY teChNIcIaN  -  Research & Development         1
saLES eXEcUTiVE  -  Sales                                1
mANUfacTURiNG dIRectOR  -  Research & Development        1
huMAn ResOurces  -  Human Resources                      1
sAleS EXECUtIvE  -  Sales                                1
Name: count, Length: 301, dtype: int64

In [8]:
df_categoricos["jobrole"].value_counts()

jobrole
mANager                    5
ManagEr                    3
mAnageR                    3
maNaGeR                    3
MANAgER                    3
                          ..
RESeaRCh sCientIsT         1
reseARCH sCIEntiST         1
REseaRCh SCiENTIst         1
LabOrATory TEChNICiaN      1
mAnUfactURInG DiRECTOr     1
Name: count, Length: 1579, dtype: int64

In [9]:
# CAMNBIO DE NÚMEROS A LETRAS 
diccionario_gender={0: "M", 1: "F"}

In [10]:
# Se realzia con un mapeo
df_categoricos["gender"]=df_categoricos["gender"].map(diccionario_gender)

In [11]:
# Se comprueba
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,Yes
1,No,NaN,NaN,Life Sciences,M,ManAGeR,NaN,NaN,NaN,NaN,NaN,1
2,No,travel_rarely,Research & Development,Technical Degree,M,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,1
3,No,travel_rarely,NaN,Medical,F,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,False
4,No,NaN,NaN,Technical Degree,F,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,0

In [12]:
df_categoricos["remotework"].value_counts()

remotework
1        375
True     362
False    318
0        318
Yes      305
Name: count, dtype: int64

In [13]:
df_categoricos['remotework'] = df_categoricos['remotework'].replace({'0': 'no', '1': 'yes', 'True': 'yes', 'False': 'no', 'Yes': 'yes'})

In [14]:
df_categoricos['businesstravel'].value_counts()

businesstravel
travel_rarely        616
travel_frequently    168
non-travel            93
Name: count, dtype: int64

In [15]:
#quitar "-" y "_" de la columna businesstravel: 
df_categoricos["businesstravel"] = df_categoricos["businesstravel"].str.replace('_', ' ', regex=False).str.replace('-', ' ', regex=False)

In [16]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,yes
1,No,NaN,NaN,Life Sciences,M,ManAGeR,NaN,NaN,NaN,NaN,NaN,yes
2,No,travel rarely,Research & Development,Technical Degree,M,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,yes
3,No,travel rarely,NaN,Medical,F,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,no
4,No,NaN,NaN,Technical Degree,F,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,no

In [17]:
## Cambiamos a minuscula columna jobrole
df_categoricos['jobrole'] = df_categoricos['jobrole'].str.lower()

In [18]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,research director,NaN,Y,No,Full Time,NaN,yes
1,No,NaN,NaN,Life Sciences,M,manager,NaN,NaN,NaN,NaN,NaN,yes
2,No,travel rarely,Research & Development,Technical Degree,M,manager,Married,NaN,No,NaN,ManaGER - Research & Development,yes
3,No,travel rarely,NaN,Medical,F,research director,Married,Y,NaN,Full Time,NaN,no
4,No,NaN,NaN,Technical Degree,F,sales executive,Divorced,Y,No,NaN,NaN,no

In [19]:

df_categoricos['maritalstatus'].value_counts()

maritalstatus
Married     419
Single      343
Divorced    194
Marreid      36
divorced     11
Name: count, dtype: int64

In [20]:
## Cambiamos 'lo que esta mal escrito en columna de marital status'
df_categoricos['maritalstatus'] = df_categoricos['maritalstatus'].map({
    'Married': 'Married',
    'divorced': 'Divorced',
    'Single': 'Single',
    'Divorced': 'Divorced'
})

In [21]:
df_categoricos['maritalstatus'].value_counts()

maritalstatus
Married     419
Single      343
Divorced    205
Name: count, dtype: int64

In [22]:
df_categoricos['over18'] = df_categoricos['over18'].replace({'Y':'Yes', 'Yes':'Yes'})

In [23]:
df_categoricos['over18'].value_counts()

over18
Yes    740
Name: count, dtype: int64

In [24]:
## Cambiamos a minuscula columna roledepartment 

df_categoricos['roledepartament'] = df_categoricos['roledepartament'].str.lower()

In [25]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,research director,NaN,Yes,No,Full Time,NaN,yes
1,No,NaN,NaN,Life Sciences,M,manager,NaN,NaN,NaN,NaN,NaN,yes
2,No,travel rarely,Research & Development,Technical Degree,M,manager,Married,NaN,No,NaN,manager - research & development,yes
3,No,travel rarely,NaN,Medical,F,research director,Married,Yes,NaN,Full Time,NaN,no
4,No,NaN,NaN,Technical Degree,F,sales executive,Divorced,Yes,No,NaN,NaN,no

In [26]:
#Guardamos DF limpio en CSV
df_categoricos.to_csv("categoricos_limpio.csv", index=True)